status/src/2022/1021.org
#+TITLE: 15 October 2022 - 21 October 2022

* MIT OCW
** 18.02 - Multiple Variable Calculus
*** Practice Exam 4 (con't.), session 97-98
* Emergency Crystal Radio
** Done.
*** Gets only KSCO in SCZ.
*** Gets only KLOK in SJ.
* Mill Controller #2
** Repurpose 'boss' hard drive
Start s/w configuration
** Need to investigate new HW/SW for eventual replacements
*** Old crap ain't gonna last forever
*** Buildroot/Linux 5.15 PREEMPT + latency tools
First pass done - boots on real hardware
* Alum Rock Data Center
** Using CentOS 7 for now - good until 2024?
** need to check alma, rocky, others? for suitability
* OLPC
** Needs ML1120 coin batteries to fix "invalid system date".
* Virtual Orchestra
** sfz file tests
*** need tooling to edit sample files
** increasingly skeptical whether quality results are possible
* gat
** spectrogram done - matches 'octave' output
* marble computing
** Programmable Marble Gate Array
*** Platform
Works!
*** Ball sensor
Received various sensors. Eliminated hall effect sensor.
*** Display
Pins resoldered. Needs testing.
* small graphics display
** Use 320x480 OLED display and ESP8266+WiFi
** BWIF (Barely Working Image Format) designed
** pamtobwif/bwiftopam mostly complete
Debugging. Simple uncompressed bitmap works on round-trip PAM comparison test.
* mcd05 32 button/led box
** Recovered schematics.
** Planning software.
** Received STM32F767 Nucleo144 with Ethernet.
* More project ideas
** Zuse Z3 simulation in Verilog
   Good excuse for floating point ALU design.
** GMPForth ports to simulators
*** SIMH for some targets (vax)
*** MAME looks interesting for microprocessor system emulations
    How to support erzatz systems?
*** Ports to classic figFORTH targets
** GMPASM assembler
   May be useful for handbuilt and rare systems (DMX1000?).
** Extracting ISO Superboard Forth ROMS for MAME emulation
** 'bwocl' OpenCL tooling
*** Offline compilation
*** Standard Kernel Running
** hardware support for classic 5V CPUs
*** RTX2000, CDP1802 still available!
*** 6502, 68000, 320C30, others on hand
*** CPUs with async bus may be supportable without RAM
*** Use Nucleo w/ 5V tolerant IO as boot loader controller
*** Could use small foorprint monitor in asm (gmpmon?)
*** Started planning for 6502.
** Existing 'retro' hardware still working?
*** OSI Superboard
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
*** Super Jolt
No output. Needs analysis.
*** Ampro Little Board
Not booting. Needs analysis.
*** Rockwell R65F11 Demo board
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
*** NMIX-0016
Works.
* David Davies
** Broadcom BCG? Employee indicted for running a brothel.
** New case C1923172, consolidated with *15* Parties.
** Next hearing 12/15/2022
