status/2022/1021.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-28 Sat 04:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>15 October 2022 - 21 October 2022</title>
<meta name="author" content="Daniel Kelley" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">15 October 2022 - 21 October 2022</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org9dc60be">1. MIT OCW</a>
<ul>
<li><a href="#org1a3d4d6">1.1. 18.02 - Multiple Variable Calculus</a>
<ul>
<li><a href="#orged58ad4">1.1.1. Practice Exam 4 (con't.), session 97-98</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd345c2e">2. Emergency Crystal Radio</a>
<ul>
<li><a href="#org9966a65">2.1. Done.</a>
<ul>
<li><a href="#orgf706113">2.1.1. Gets only KSCO in SCZ.</a></li>
<li><a href="#org2761520">2.1.2. Gets only KLOK in SJ.</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org305b08e">3. Mill Controller #2</a>
<ul>
<li><a href="#org9326f83">3.1. Repurpose 'boss' hard drive</a></li>
<li><a href="#org2e0eaac">3.2. Need to investigate new HW/SW for eventual replacements</a>
<ul>
<li><a href="#orga7bee63">3.2.1. Old crap ain't gonna last forever</a></li>
<li><a href="#orgebca19d">3.2.2. Buildroot/Linux 5.15 PREEMPT + latency tools</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgc460dff">4. Alum Rock Data Center</a>
<ul>
<li><a href="#org661039f">4.1. Using CentOS 7 for now - good until 2024?</a></li>
<li><a href="#org694c102">4.2. need to check alma, rocky, others? for suitability</a></li>
</ul>
</li>
<li><a href="#org7870d10">5. OLPC</a>
<ul>
<li><a href="#org9c916d1">5.1. Needs ML1120 coin batteries to fix "invalid system date".</a></li>
</ul>
</li>
<li><a href="#orga9cac6d">6. Virtual Orchestra</a>
<ul>
<li><a href="#orgfd0d432">6.1. sfz file tests</a>
<ul>
<li><a href="#org2cbe8a7">6.1.1. need tooling to edit sample files</a></li>
</ul>
</li>
<li><a href="#orga6aeb44">6.2. increasingly skeptical whether quality results are possible</a></li>
</ul>
</li>
<li><a href="#org5541fed">7. gat</a>
<ul>
<li><a href="#org054d6f4">7.1. spectrogram done - matches 'octave' output</a></li>
</ul>
</li>
<li><a href="#orgf130577">8. marble computing</a>
<ul>
<li><a href="#orgf1e1c97">8.1. Programmable Marble Gate Array</a>
<ul>
<li><a href="#org328f975">8.1.1. Platform</a></li>
<li><a href="#org93f5112">8.1.2. Ball sensor</a></li>
<li><a href="#org4599c17">8.1.3. Display</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf95ae5a">9. small graphics display</a>
<ul>
<li><a href="#org3d2e771">9.1. Use 320x480 OLED display and ESP8266+WiFi</a></li>
<li><a href="#org1bca16b">9.2. BWIF (Barely Working Image Format) designed</a></li>
<li><a href="#org8e981da">9.3. pamtobwif/bwiftopam mostly complete</a></li>
</ul>
</li>
<li><a href="#org8f997c1">10. mcd05 32 button/led box</a>
<ul>
<li><a href="#org39b0047">10.1. Recovered schematics.</a></li>
<li><a href="#org67e4e44">10.2. Planning software.</a></li>
<li><a href="#org6b2e8ed">10.3. Received STM32F767 Nucleo144 with Ethernet.</a></li>
</ul>
</li>
<li><a href="#org58eb24d">11. More project ideas</a>
<ul>
<li><a href="#org1bdbdf5">11.1. Zuse Z3 simulation in Verilog</a></li>
<li><a href="#org7b07a26">11.2. GMPForth ports to simulators</a>
<ul>
<li><a href="#orged52cff">11.2.1. SIMH for some targets (vax)</a></li>
<li><a href="#org210e1f8">11.2.2. MAME looks interesting for microprocessor system emulations</a></li>
<li><a href="#org745ef3c">11.2.3. Ports to classic figFORTH targets</a></li>
</ul>
</li>
<li><a href="#org3e67bdb">11.3. GMPASM assembler</a></li>
<li><a href="#orge36c271">11.4. Extracting ISO Superboard Forth ROMS for MAME emulation</a></li>
<li><a href="#org1d00304">11.5. 'bwocl' OpenCL tooling</a>
<ul>
<li><a href="#orgf1d6766">11.5.1. Offline compilation</a></li>
<li><a href="#orgb54a790">11.5.2. Standard Kernel Running</a></li>
</ul>
</li>
<li><a href="#org0b735b1">11.6. hardware support for classic 5V CPUs</a>
<ul>
<li><a href="#orga855bdd">11.6.1. RTX2000, CDP1802 still available!</a></li>
<li><a href="#org90aa937">11.6.2. 6502, 68000, 320C30, others on hand</a></li>
<li><a href="#org6e21ed7">11.6.3. CPUs with async bus may be supportable without RAM</a></li>
<li><a href="#org24a62e5">11.6.4. Use Nucleo w/ 5V tolerant IO as boot loader controller</a></li>
<li><a href="#org48a9d8e">11.6.5. Could use small foorprint monitor in asm (gmpmon?)</a></li>
<li><a href="#org41b4a83">11.6.6. Started planning for 6502.</a></li>
</ul>
</li>
<li><a href="#org8b63356">11.7. Existing 'retro' hardware still working?</a>
<ul>
<li><a href="#orgd18650a">11.7.1. OSI Superboard</a></li>
<li><a href="#org299e907">11.7.2. Super Jolt</a></li>
<li><a href="#org5650497">11.7.3. Ampro Little Board</a></li>
<li><a href="#org76bf9d5">11.7.4. Rockwell R65F11 Demo board</a></li>
<li><a href="#orgc4f185b">11.7.5. NMIX-0016</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgef87719">12. David Davies</a>
<ul>
<li><a href="#org069ea1c">12.1. Broadcom BCG? Employee indicted for running a brothel.</a></li>
<li><a href="#org65cfa47">12.2. New case C1923172, consolidated with <b>15</b> Parties.</a></li>
<li><a href="#org9b11a1d">12.3. Next hearing 12/15/2022</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org9dc60be" class="outline-2">
<h2 id="org9dc60be"><span class="section-number-2">1.</span> MIT OCW</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org1a3d4d6" class="outline-3">
<h3 id="org1a3d4d6"><span class="section-number-3">1.1.</span> 18.02 - Multiple Variable Calculus</h3>
<div class="outline-text-3" id="text-1-1">
</div>
<div id="outline-container-orged58ad4" class="outline-4">
<h4 id="orged58ad4"><span class="section-number-4">1.1.1.</span> Practice Exam 4 (con't.), session 97-98</h4>
</div>
</div>
</div>
<div id="outline-container-orgd345c2e" class="outline-2">
<h2 id="orgd345c2e"><span class="section-number-2">2.</span> Emergency Crystal Radio</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org9966a65" class="outline-3">
<h3 id="org9966a65"><span class="section-number-3">2.1.</span> Done.</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgf706113" class="outline-4">
<h4 id="orgf706113"><span class="section-number-4">2.1.1.</span> Gets only KSCO in SCZ.</h4>
</div>
<div id="outline-container-org2761520" class="outline-4">
<h4 id="org2761520"><span class="section-number-4">2.1.2.</span> Gets only KLOK in SJ.</h4>
</div>
</div>
</div>
<div id="outline-container-org305b08e" class="outline-2">
<h2 id="org305b08e"><span class="section-number-2">3.</span> Mill Controller #2</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org9326f83" class="outline-3">
<h3 id="org9326f83"><span class="section-number-3">3.1.</span> Repurpose 'boss' hard drive</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Start s/w configuration
</p>
</div>
</div>
<div id="outline-container-org2e0eaac" class="outline-3">
<h3 id="org2e0eaac"><span class="section-number-3">3.2.</span> Need to investigate new HW/SW for eventual replacements</h3>
<div class="outline-text-3" id="text-3-2">
</div>
<div id="outline-container-orga7bee63" class="outline-4">
<h4 id="orga7bee63"><span class="section-number-4">3.2.1.</span> Old crap ain't gonna last forever</h4>
</div>
<div id="outline-container-orgebca19d" class="outline-4">
<h4 id="orgebca19d"><span class="section-number-4">3.2.2.</span> Buildroot/Linux 5.15 PREEMPT + latency tools</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
First pass done - boots on real hardware
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc460dff" class="outline-2">
<h2 id="orgc460dff"><span class="section-number-2">4.</span> Alum Rock Data Center</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org661039f" class="outline-3">
<h3 id="org661039f"><span class="section-number-3">4.1.</span> Using CentOS 7 for now - good until 2024?</h3>
</div>
<div id="outline-container-org694c102" class="outline-3">
<h3 id="org694c102"><span class="section-number-3">4.2.</span> need to check alma, rocky, others? for suitability</h3>
</div>
</div>
<div id="outline-container-org7870d10" class="outline-2">
<h2 id="org7870d10"><span class="section-number-2">5.</span> OLPC</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org9c916d1" class="outline-3">
<h3 id="org9c916d1"><span class="section-number-3">5.1.</span> Needs ML1120 coin batteries to fix "invalid system date".</h3>
</div>
</div>
<div id="outline-container-orga9cac6d" class="outline-2">
<h2 id="orga9cac6d"><span class="section-number-2">6.</span> Virtual Orchestra</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-orgfd0d432" class="outline-3">
<h3 id="orgfd0d432"><span class="section-number-3">6.1.</span> sfz file tests</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org2cbe8a7" class="outline-4">
<h4 id="org2cbe8a7"><span class="section-number-4">6.1.1.</span> need tooling to edit sample files</h4>
</div>
</div>
<div id="outline-container-orga6aeb44" class="outline-3">
<h3 id="orga6aeb44"><span class="section-number-3">6.2.</span> increasingly skeptical whether quality results are possible</h3>
</div>
</div>
<div id="outline-container-org5541fed" class="outline-2">
<h2 id="org5541fed"><span class="section-number-2">7.</span> gat</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org054d6f4" class="outline-3">
<h3 id="org054d6f4"><span class="section-number-3">7.1.</span> spectrogram done - matches 'octave' output</h3>
</div>
</div>
<div id="outline-container-orgf130577" class="outline-2">
<h2 id="orgf130577"><span class="section-number-2">8.</span> marble computing</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-orgf1e1c97" class="outline-3">
<h3 id="orgf1e1c97"><span class="section-number-3">8.1.</span> Programmable Marble Gate Array</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-org328f975" class="outline-4">
<h4 id="org328f975"><span class="section-number-4">8.1.1.</span> Platform</h4>
<div class="outline-text-4" id="text-8-1-1">
<p>
Works!
</p>
</div>
</div>
<div id="outline-container-org93f5112" class="outline-4">
<h4 id="org93f5112"><span class="section-number-4">8.1.2.</span> Ball sensor</h4>
<div class="outline-text-4" id="text-8-1-2">
<p>
Received various sensors. Eliminated hall effect sensor.
</p>
</div>
</div>
<div id="outline-container-org4599c17" class="outline-4">
<h4 id="org4599c17"><span class="section-number-4">8.1.3.</span> Display</h4>
<div class="outline-text-4" id="text-8-1-3">
<p>
Pins resoldered. Needs testing.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf95ae5a" class="outline-2">
<h2 id="orgf95ae5a"><span class="section-number-2">9.</span> small graphics display</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-org3d2e771" class="outline-3">
<h3 id="org3d2e771"><span class="section-number-3">9.1.</span> Use 320x480 OLED display and ESP8266+WiFi</h3>
</div>
<div id="outline-container-org1bca16b" class="outline-3">
<h3 id="org1bca16b"><span class="section-number-3">9.2.</span> BWIF (Barely Working Image Format) designed</h3>
</div>
<div id="outline-container-org8e981da" class="outline-3">
<h3 id="org8e981da"><span class="section-number-3">9.3.</span> pamtobwif/bwiftopam mostly complete</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Debugging. Simple uncompressed bitmap works on round-trip PAM comparison test.
</p>
</div>
</div>
</div>
<div id="outline-container-org8f997c1" class="outline-2">
<h2 id="org8f997c1"><span class="section-number-2">10.</span> mcd05 32 button/led box</h2>
<div class="outline-text-2" id="text-10">
</div>
<div id="outline-container-org39b0047" class="outline-3">
<h3 id="org39b0047"><span class="section-number-3">10.1.</span> Recovered schematics.</h3>
</div>
<div id="outline-container-org67e4e44" class="outline-3">
<h3 id="org67e4e44"><span class="section-number-3">10.2.</span> Planning software.</h3>
</div>
<div id="outline-container-org6b2e8ed" class="outline-3">
<h3 id="org6b2e8ed"><span class="section-number-3">10.3.</span> Received STM32F767 Nucleo144 with Ethernet.</h3>
</div>
</div>
<div id="outline-container-org58eb24d" class="outline-2">
<h2 id="org58eb24d"><span class="section-number-2">11.</span> More project ideas</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org1bdbdf5" class="outline-3">
<h3 id="org1bdbdf5"><span class="section-number-3">11.1.</span> Zuse Z3 simulation in Verilog</h3>
<div class="outline-text-3" id="text-11-1">
<p>
Good excuse for floating point ALU design.
</p>
</div>
</div>
<div id="outline-container-org7b07a26" class="outline-3">
<h3 id="org7b07a26"><span class="section-number-3">11.2.</span> GMPForth ports to simulators</h3>
<div class="outline-text-3" id="text-11-2">
</div>
<div id="outline-container-orged52cff" class="outline-4">
<h4 id="orged52cff"><span class="section-number-4">11.2.1.</span> SIMH for some targets (vax)</h4>
</div>
<div id="outline-container-org210e1f8" class="outline-4">
<h4 id="org210e1f8"><span class="section-number-4">11.2.2.</span> MAME looks interesting for microprocessor system emulations</h4>
<div class="outline-text-4" id="text-11-2-2">
<p>
How to support erzatz systems?
</p>
</div>
</div>
<div id="outline-container-org745ef3c" class="outline-4">
<h4 id="org745ef3c"><span class="section-number-4">11.2.3.</span> Ports to classic figFORTH targets</h4>
</div>
</div>
<div id="outline-container-org3e67bdb" class="outline-3">
<h3 id="org3e67bdb"><span class="section-number-3">11.3.</span> GMPASM assembler</h3>
<div class="outline-text-3" id="text-11-3">
<p>
May be useful for handbuilt and rare systems (DMX1000?).
</p>
</div>
</div>
<div id="outline-container-orge36c271" class="outline-3">
<h3 id="orge36c271"><span class="section-number-3">11.4.</span> Extracting ISO Superboard Forth ROMS for MAME emulation</h3>
</div>
<div id="outline-container-org1d00304" class="outline-3">
<h3 id="org1d00304"><span class="section-number-3">11.5.</span> 'bwocl' OpenCL tooling</h3>
<div class="outline-text-3" id="text-11-5">
</div>
<div id="outline-container-orgf1d6766" class="outline-4">
<h4 id="orgf1d6766"><span class="section-number-4">11.5.1.</span> Offline compilation</h4>
</div>
<div id="outline-container-orgb54a790" class="outline-4">
<h4 id="orgb54a790"><span class="section-number-4">11.5.2.</span> Standard Kernel Running</h4>
</div>
</div>
<div id="outline-container-org0b735b1" class="outline-3">
<h3 id="org0b735b1"><span class="section-number-3">11.6.</span> hardware support for classic 5V CPUs</h3>
<div class="outline-text-3" id="text-11-6">
</div>
<div id="outline-container-orga855bdd" class="outline-4">
<h4 id="orga855bdd"><span class="section-number-4">11.6.1.</span> RTX2000, CDP1802 still available!</h4>
</div>
<div id="outline-container-org90aa937" class="outline-4">
<h4 id="org90aa937"><span class="section-number-4">11.6.2.</span> 6502, 68000, 320C30, others on hand</h4>
</div>
<div id="outline-container-org6e21ed7" class="outline-4">
<h4 id="org6e21ed7"><span class="section-number-4">11.6.3.</span> CPUs with async bus may be supportable without RAM</h4>
</div>
<div id="outline-container-org24a62e5" class="outline-4">
<h4 id="org24a62e5"><span class="section-number-4">11.6.4.</span> Use Nucleo w/ 5V tolerant IO as boot loader controller</h4>
</div>
<div id="outline-container-org48a9d8e" class="outline-4">
<h4 id="org48a9d8e"><span class="section-number-4">11.6.5.</span> Could use small foorprint monitor in asm (gmpmon?)</h4>
</div>
<div id="outline-container-org41b4a83" class="outline-4">
<h4 id="org41b4a83"><span class="section-number-4">11.6.6.</span> Started planning for 6502.</h4>
</div>
</div>
<div id="outline-container-org8b63356" class="outline-3">
<h3 id="org8b63356"><span class="section-number-3">11.7.</span> Existing 'retro' hardware still working?</h3>
<div class="outline-text-3" id="text-11-7">
</div>
<div id="outline-container-orgd18650a" class="outline-4">
<h4 id="orgd18650a"><span class="section-number-4">11.7.1.</span> OSI Superboard</h4>
<div class="outline-text-4" id="text-11-7-1">
<p>
Unknown. Composite to VGA adapter didn't seem to work. Needs analysis.
Found OSI model 610 board underneath!
</p>
</div>
</div>
<div id="outline-container-org299e907" class="outline-4">
<h4 id="org299e907"><span class="section-number-4">11.7.2.</span> Super Jolt</h4>
<div class="outline-text-4" id="text-11-7-2">
<p>
No output. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org5650497" class="outline-4">
<h4 id="org5650497"><span class="section-number-4">11.7.3.</span> Ampro Little Board</h4>
<div class="outline-text-4" id="text-11-7-3">
<p>
Not booting. Needs analysis.
</p>
</div>
</div>
<div id="outline-container-org76bf9d5" class="outline-4">
<h4 id="org76bf9d5"><span class="section-number-4">11.7.4.</span> Rockwell R65F11 Demo board</h4>
<div class="outline-text-4" id="text-11-7-4">
<p>
UART sending "NO ROM" at 2400 7N1 as expected with 2MHz xtal.
</p>
</div>
</div>
<div id="outline-container-orgc4f185b" class="outline-4">
<h4 id="orgc4f185b"><span class="section-number-4">11.7.5.</span> NMIX-0016</h4>
<div class="outline-text-4" id="text-11-7-5">
<p>
Works.
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-orgef87719" class="outline-2">
<h2 id="orgef87719"><span class="section-number-2">12.</span> David Davies</h2>
<div class="outline-text-2" id="text-12">
</div>
<div id="outline-container-org069ea1c" class="outline-3">
<h3 id="org069ea1c"><span class="section-number-3">12.1.</span> Broadcom BCG? Employee indicted for running a brothel.</h3>
</div>
<div id="outline-container-org65cfa47" class="outline-3">
<h3 id="org65cfa47"><span class="section-number-3">12.2.</span> New case C1923172, consolidated with <b>15</b> Parties.</h3>
</div>
<div id="outline-container-org9b11a1d" class="outline-3">
<h3 id="org9b11a1d"><span class="section-number-3">12.3.</span> Next hearing 12/15/2022</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Daniel Kelley</p>
<p class="date">Created: 2023-10-28 Sat 04:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>